Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateCornice Property
 Could not create Wall Sweep. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCornice { get; }
Public Shared ReadOnly Property CannotCreateCornice As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCornice {
	FailureDefinitionId^ get ();
}
static member CannotCreateCornice : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace